[
    {
        "id": 1,
	"closed": true,
	"completed": 0,
        "name": "Курс \"Cross-platform developer on JavaScript\"",
        "start_date": "24 Сентября",
        "duration": "5 месяцев",
        "location": "Казань",
        "description": "Авторский курс под руководством преподавателей IT-хаба Сбера. Продолжительность курса - 5 месяцев. Объем курса - 124 акад./ч. Стоимость - 55 000 рублей (возможна рассрочка платежа). Формат: офлайн.",
        "short_description": "Профессиональный курс по разработке на JavaScript в Казани.",
        "type": "adults",
        "link": "https://academy.itpark.tech/courses/cross-platform-developer-on-javascript/",
	"entity": "course",    
        "reviews": [
		{
			"author": "Анна Смирнова",
			"grade": 5,
			"text": "Очень довольна курсом! Модули по UX/UI в Figma и основам микрофронтенд-архитектуры действительно расширили мои навыки. Понравилось, что преподаватели используют реальные кейсы для объяснения тем. Особенно порадовал модуль с интеграцией MongoDB и Express — отлично структурировано."
		},
		{
			"author": "Виктор Тихонов",
			"grade": 4,
			"text": "Отличная программа, особенно понравился блок по серверной разработке на Node.js, где мы написали REST API для симуляции библиотеки. Занятия интересные, но иногда хотелось больше времени на вопросы, особенно в темах по тестированию с Jest и CI/CD настройке."
		},
		{
			"author": "Ольга Петрова",
			"grade": 3,
			"text": "Курс неплохой, но материал местами трудноват. Модуль по Redux и управлению состоянием оказался очень сложным. Хотелось бы больше примеров и заданий по этой теме, и немного больше фокусировки на теории перед сложными практиками."
		},
		{
			"author": "Евгений Борисов",
			"grade": 5,
			"text": "Учебный процесс на высоте! Командная работа над разработкой чат-приложения помогла лучше понять процессы работы с WebSocket и сборку релизов для web и mobile. Много ценной информации и обратной связи от преподавателей."
		},
		{
			"author": "Дарья Иванова",
			"grade": 4,
			"text": "Хороший курс, хотя цена могла бы быть чуть ниже. В остальном всё понравилось: глубокое погружение в React, включая hooks и рендеринг компонентов. Задания интересные, особенно понравилась практика с MongoDB для хранения пользовательских данных."
		},
		{
			"author": "Максим Козлов",
			"grade": 2,
			"text": "Ожидал больше от курса. Практика по интеграции сторонних API была короткой и малоинформативной. Хотелось бы глубже изучить работу с авторизацией и защитой данных. Темп быстрый, тяжело усваивать, особенно работу с SSR и Next.js."
		},
		{
			"author": "Александр Семенов",
			"grade": 5,
			"text": "Рекомендую! Изучили TDD и как писать unit-тесты для сложных компонентов, что стало для меня новым уровнем в разработке. Командные проекты также отличная возможность понять, как вести код-ревью и делать pull requests."
		},
		{
			"author": "Марина Павлова",
			"grade": 4,
			"text": "Замечательные преподаватели и команда. Модуль по клиент-серверному взаимодействию оказался полезным — научились настраивать аутентификацию через JWT и работать с middlewares в Express. Иногда было сложно совмещать с работой, но помощь куратора всегда спасала."
		},
		{
			"author": "Николай Жуков",
			"grade": 3,
			"text": "Интересный курс, но ожидал больше практики с реальными проектами. Блок по micro-frontend был интересным, но, как оказалось, недостаточно практическим. Возможно, стоит добавить больше времени для полноценного развертывания микросервисов."
		},
		{
			"author": "Татьяна Крылова",
			"grade": 5,
			"text": "Потрясающая программа! Особенно понравился раздел с проектированием UI в Figma и работа с компонентами в React. Преподаватель помогал разбираться даже в мелочах. Большой плюс — командные проекты с полноценной интеграцией API."
		},
		{
			"author": "Игорь Лебедев",
			"grade": 4,
			"text": "Очень полезный курс для тех, кто уже знаком с основами JavaScript. Темы сложные, но интересные, особенно разработка бэкэнда на Node с использованием Express и Mongo. Хотелось бы побольше времени на разбор тестов с Jest."
		},
		{
			"author": "Светлана Григорьева",
			"grade": 2,
			"text": "Слишком сложно для новичка в JavaScript. Модуль по управлению состоянием оказался сложным, а темы про микросервисы не дали четкого представления. Поняла далеко не всё, возможно, нужна дополнительная подготовка для таких курсов."
		},
		{
			"author": "Дмитрий Кузьмин",
			"grade": 5,
			"text": "Курс действительно помог перейти на новый уровень! Особенно запомнились разделы по TDD и CI/CD. Много узнал о построении full-stack приложений. Финальная аттестация дала уверенность в своих знаниях. Сильный курс, рекомендую!"
		},
		{
			"author": "Алина Васильева",
			"grade": 3,
			"text": "Курс хороший, но сложный для совмещения с работой. Темы по интеграции с внешними сервисами и работе с MongoDB нуждаются в доработке. Хотелось бы больше материалов для самостоятельной подготовки и разбора тем."
		},
		{
			"author": "Роман Зайцев",
			"grade": 4,
			"text": "Очень доволен курсом! Особенно полезными были практики по написанию тестов на Jest и настройке DevOps. Реальный проект по разработке SPA для мобильного приложения дал ценный опыт работы с адаптивными интерфейсами."
		}
	],
        "summarized_reviews": "Курс высоко оценен за квалификацию преподавателей и подачу материала.",
        "teacher_ids": [1, 2]
    },
    {
        "id": 2,
	"closed": false,
	"completed": 100,
        "name": "Курс \"Программирование на Java\"",
        "start_date": "25 Сентября",
        "duration": "50 акад./ч",
        "location": "Казань",
        "description": "Программа по изучению Java для начинающих. Основы работы с IntelliJ Idea и Git. Продолжительность курса - 3 месяца. Объем курса - 50 акад./ч. Стоимость - 40 000 рублей (возможна рассрочка платежа). Формат: офлайн.",
        "short_description": "Курс по программированию на Java для начинающих.",
        "type": "adults",
        "link": "https://academy.itpark.tech/courses/programmirovanie-na-java/",
	"entity": "event",
        "reviews": [
        {
            "author": "Екатерина Смирнова",
            "grade": 5,
            "text": "Замечательный курс для новичков! Мы начали с самых основ, и постепенно преподаватели объяснили даже сложные темы, такие как многопоточность и коллекции. Приятно, что куратор всегда был на связи и помогал с трудными заданиями. Понравился проект с базой данных и SQL — настоящий опыт для портфолио!"
        },
        {
            "author": "Алексей Федоров",
            "grade": 4,
            "text": "Интересный курс, но было бы полезно добавить больше примеров на коллекции. Понравились занятия по Spring и Git, где мы создали небольшое приложение для учета задач. Преподаватель терпеливо отвечал на все вопросы, даже когда задавал их по несколько раз!"
        },
        {
            "author": "Ирина Малышева",
            "grade": 3,
            "text": "Курс хороший, но иногда слишком быстрый темп, трудно усваивать материал с нуля. Особенно тяжело дались темы по многопоточности. Думаю, новичкам было бы легче с более плавным введением. Проект по SQL интересный, но было бы здорово, если бы на него дали больше времени."
        },
        {
            "author": "Сергей Куликов",
            "grade": 5,
            "text": "Курс идеально подходит для тех, кто вообще не знает программирования! Научился основам Java, и даже SQL теперь не вызывает страха. Задания были продуманы, а проект с использованием Git и Spring получился классным. Спасибо кураторам за поддержку!"
        },
        {
            "author": "Анна Петрова",
            "grade": 2,
            "text": "Курс оказался сложнее, чем ожидала, слишком быстро перешли от основ к сложным темам вроде многопоточности. Хотелось бы больше практических упражнений перед тем, как переходить к продвинутым темам. Не уверена, что освою Java до конца."
        },
        {
            "author": "Михаил Зайцев",
            "grade": 4,
            "text": "Очень полезный курс! Понравились занятия по коллекциям и практическая работа с базами данных. Единственный минус — слишком кратко прошли тему Git. Хотелось бы побольше наработок по практике в Git, особенно командные задачи."
        },
        {
            "author": "Татьяна Кузьмина",
            "grade": 3,
            "text": "Курс насыщенный, но много непонятных моментов для новичка. Тема по SQL и интеграции с Java интересная, но многопоточность вообще не осилила. Возможно, следовало разбить материал на большее количество уроков."
        },
        {
            "author": "Иван Васильев",
            "grade": 5,
            "text": "Полностью доволен! Мы создали небольшое консольное приложение для учета задач, используя базы данных и многопоточность. На занятиях было очень комфортно, куратор всегда поддерживал. Особенно понравился блок с основами Spring — теперь не боюсь брать заказы на фрилансе!"
        },
        {
            "author": "Марина Козлова",
            "grade": 4,
            "text": "Отличный курс для старта! Понравился модуль по синтаксису и работе с Java core. Могли бы сделать больше практических заданий на коллекции, но проект с базой данных удался. Благодарю преподавателя за терпение и внимание к каждому вопросу."
        },
        {
            "author": "Олег Тихонов",
            "grade": 2,
            "text": "Сложно рекомендовать этот курс для абсолютных новичков. Темп быстрый, а многопоточность и SQL слишком трудные для освоения за такое короткое время. Возможно, добавление дополнительных упражнений помогло бы."
        },
        {
            "author": "Светлана Романова",
            "grade": 5,
            "text": "Курс просто супер! Научилась многому — от базовых операторов до работы с коллекциями и SQL. Особенно запомнилось занятие по Java и Spring, где мы настроили небольшой сервер для работы с базой данных. Поддержка куратора — отдельный плюс!"
        },
        {
            "author": "Денис Егоров",
            "grade": 4,
            "text": "Интересный курс, преподаватели и кураторы всегда поддерживали. Немного не хватало теории перед практическими заданиями, но в целом курс на уровне. Удобно, что дают записи всех уроков для пересмотра. Портфолио пригодится!"
        },
        {
            "author": "Елена Лебедева",
            "grade": 3,
            "text": "Курс познавательный, но многопоточность для новичков — перебор. Темы по SQL понравились, хотя и было сложно. Думаю, что курс больше подойдет для тех, у кого уже есть небольшой опыт. Понравилось, что выдали сертификат по окончании."
        },
        {
            "author": "Кирилл Соколов",
            "grade": 5,
            "text": "Рад, что выбрал этот курс! Мы писали простое приложение с многопоточностью и SQL, а преподаватель подробно объяснял сложные моменты. Понравился подход с постоянным контролем знаний — это мотивировало заниматься и задавать вопросы."
        },
        {
            "author": "Юлия Павлова",
            "grade": 4,
            "text": "Хороший курс, особенно для новичков. Понравились разделы с базами данных и контроль версий Git. Жаль, что мало времени на Spring и интеграцию с SQL, но в целом довольна. Преподаватель всегда доступен и готов помочь с любыми вопросами."
        }
    ],
        "summarized_reviews": "Отзывы положительные, но есть запрос на увеличение практической части.",
        "teacher_ids": [3]
    }
]
