[{
	"name": "Введение в реляционные базы данных",
	"start_date": "",
	"duration": "",
	"location": "",
	"description": "",
	"link": "",
	"reviews": [
	  {
		"author": "Мария Зотова",
		"grade": 5,
		"text": "Замечательный курс для начинающих! Понравилось, что уделили много внимания синтаксису SQL и практическим заданиям на PostgreSQL. Преподаватель всегда доступен для вопросов, а куратор помогал с организацией учебного процесса. На выпускной работе мы поднимали свою базу с нуля — это было полезно для портфолио!"
	  },
	  {
		"author": "Дмитрий Малышев",
		"grade": 4,
		"text": "Очень структурированный курс. Постепенно разобрали основные команды SQL, DDL и DML. Интересно было работать с реальными кейсами для создания физической модели данных. Хотелось бы побольше времени на практику, но в целом все понравилось."
	  },
	  {
		"author": "Ольга Сидорова",
		"grade": 3,
		"text": "Курс интересный, но слишком быстрый темп. Много информации по логическим и физическим моделям данных, а времени для закрепления мало. Понравилось занятие по созданию сложных SQL-запросов, но хотелось бы больше разборов примеров."
	  },
	  {
		"author": "Иван Петров",
		"grade": 5,
		"text": "Для аналитиков курс просто необходим! Мы создавали собственные базы данных, работали с реальными примерами и учились оптимизировать запросы. Очень полезными оказались уроки по моделированию данных, куратор всегда помогал, если что-то было непонятно."
	  },
	  {
		"author": "Екатерина Белова",
		"grade": 4,
		"text": "Хороший курс для начинающих аналитиков! Понравился подход к обучению, особенно задания на написание сложных SQL-запросов. Было бы здорово добавить еще одну консультацию перед защитой проекта."
	  },
	  {
		"author": "Алексей Козлов",
		"grade": 5,
		"text": "Отличный старт для дата-инженеров! Преподаватель подробно объяснял, как правильно строить запросы и работать с данными в PostgreSQL. Понравилась защита проекта, где мы закрепили и осознали, что научились делать. Курс однозначно стоит своих денег."
	  },
	  {
		"author": "Анна Морозова",
		"grade": 3,
		"text": "В целом курс хороший, но многовато теории, особенно по DDL и DML. Трудно было разобраться с моделированием данных, но преподаватель всегда помогал с трудными темами. Не помешало бы больше практики на SQL."
	  },
	  {
		"author": "Николай Смирнов",
		"grade": 4,
		"text": "Интересный курс! Научился писать сложные запросы и понял, как строить модели данных. Понравилось, что преподаватели давали обратную связь по заданиям. Немного не хватило времени на анализ логических моделей."
	  },
	  {
		"author": "Юлия Гусева",
		"grade": 5,
		"text": "Отличный курс для аналитиков! Научилась работать с SQL, создавать таблицы, связи, писать запросы для аналитики. Особенно понравилась выпускная работа — мы создавали собственную базу с данными, а потом защищали её перед преподавателями."
	  },
	  {
		"author": "Андрей Лебедев",
		"grade": 4,
		"text": "Полезный курс, особенно для тех, кто начинает карьеру в аналитике. Преподаватель хорошо объясняет SQL и модель данных. Единственное, хотелось бы больше подробностей по оптимизации запросов и индексации таблиц."
	  },
	  {
		"author": "Виктория Титова",
		"grade": 3,
		"text": "Много полезной информации, но немного сбитое расписание, особенно тяжело было успевать с заданиями. Очень понравились занятия по DML и аналитическим запросам, но проект с физической моделью получился сложным для новичка."
	  },
	  {
		"author": "Максим Орлов",
		"grade": 5,
		"text": "Замечательный курс! Преподаватели дали все необходимое для работы с базами данных, от создания таблиц до аналитических запросов. Поддержка куратора помогала справиться с заданиями, особенно на выходных, когда было больше времени."
	  },
	  {
		"author": "Лариса Зайцева",
		"grade": 4,
		"text": "Курс помог освоить основы SQL и понять, как моделировать данные для реальных задач. Понравились занятия по анализу данных и разработке структуры базы. Хотелось бы больше примеров на моделирование."
	  },
	  {
		"author": "Сергей Волков",
		"grade": 5,
		"text": "Прекрасный курс для начинающих аналитиков! Научился составлять запросы и создавать логические модели данных. Выпускная работа с защитой проекта была очень полезной, особенно с комментариями преподавателей."
	  },
	  {
		"author": "Татьяна Куликова",
		"grade": 4,
		"text": "Интересный курс, узнала много нового о реляционных базах данных и работе с PostgreSQL. Немного не хватило подробностей по сложным аналитическим запросам, но в целом очень довольна!"
	  }
	],
	"summarized_reviews": []
  }
]