[{
    "name": "Курс 'Программирование на Java'",
    "start_date": "string",
    "duration": "string",
    "location": "string",
    "description": "string",
    "link": "string",
    "reviews": [
        {
            "author": "Екатерина Смирнова",
            "grade": 5,
            "text": "Замечательный курс для новичков! Мы начали с самых основ, и постепенно преподаватели объяснили даже сложные темы, такие как многопоточность и коллекции. Приятно, что куратор всегда был на связи и помогал с трудными заданиями. Понравился проект с базой данных и SQL — настоящий опыт для портфолио!"
        },
        {
            "author": "Алексей Федоров",
            "grade": 4,
            "text": "Интересный курс, но было бы полезно добавить больше примеров на коллекции. Понравились занятия по Spring и Git, где мы создали небольшое приложение для учета задач. Преподаватель терпеливо отвечал на все вопросы, даже когда задавал их по несколько раз!"
        },
        {
            "author": "Ирина Малышева",
            "grade": 3,
            "text": "Курс хороший, но иногда слишком быстрый темп, трудно усваивать материал с нуля. Особенно тяжело дались темы по многопоточности. Думаю, новичкам было бы легче с более плавным введением. Проект по SQL интересный, но было бы здорово, если бы на него дали больше времени."
        },
        {
            "author": "Сергей Куликов",
            "grade": 5,
            "text": "Курс идеально подходит для тех, кто вообще не знает программирования! Научился основам Java, и даже SQL теперь не вызывает страха. Задания были продуманы, а проект с использованием Git и Spring получился классным. Спасибо кураторам за поддержку!"
        },
        {
            "author": "Анна Петрова",
            "grade": 2,
            "text": "Курс оказался сложнее, чем ожидала, слишком быстро перешли от основ к сложным темам вроде многопоточности. Хотелось бы больше практических упражнений перед тем, как переходить к продвинутым темам. Не уверена, что освою Java до конца."
        },
        {
            "author": "Михаил Зайцев",
            "grade": 4,
            "text": "Очень полезный курс! Понравились занятия по коллекциям и практическая работа с базами данных. Единственный минус — слишком кратко прошли тему Git. Хотелось бы побольше наработок по практике в Git, особенно командные задачи."
        },
        {
            "author": "Татьяна Кузьмина",
            "grade": 3,
            "text": "Курс насыщенный, но много непонятных моментов для новичка. Тема по SQL и интеграции с Java интересная, но многопоточность вообще не осилила. Возможно, следовало разбить материал на большее количество уроков."
        },
        {
            "author": "Иван Васильев",
            "grade": 5,
            "text": "Полностью доволен! Мы создали небольшое консольное приложение для учета задач, используя базы данных и многопоточность. На занятиях было очень комфортно, куратор всегда поддерживал. Особенно понравился блок с основами Spring — теперь не боюсь брать заказы на фрилансе!"
        },
        {
            "author": "Марина Козлова",
            "grade": 4,
            "text": "Отличный курс для старта! Понравился модуль по синтаксису и работе с Java core. Могли бы сделать больше практических заданий на коллекции, но проект с базой данных удался. Благодарю преподавателя за терпение и внимание к каждому вопросу."
        },
        {
            "author": "Олег Тихонов",
            "grade": 2,
            "text": "Сложно рекомендовать этот курс для абсолютных новичков. Темп быстрый, а многопоточность и SQL слишком трудные для освоения за такое короткое время. Возможно, добавление дополнительных упражнений помогло бы."
        },
        {
            "author": "Светлана Романова",
            "grade": 5,
            "text": "Курс просто супер! Научилась многому — от базовых операторов до работы с коллекциями и SQL. Особенно запомнилось занятие по Java и Spring, где мы настроили небольшой сервер для работы с базой данных. Поддержка куратора — отдельный плюс!"
        },
        {
            "author": "Денис Егоров",
            "grade": 4,
            "text": "Интересный курс, преподаватели и кураторы всегда поддерживали. Немного не хватало теории перед практическими заданиями, но в целом курс на уровне. Удобно, что дают записи всех уроков для пересмотра. Портфолио пригодится!"
        },
        {
            "author": "Елена Лебедева",
            "grade": 3,
            "text": "Курс познавательный, но многопоточность для новичков — перебор. Темы по SQL понравились, хотя и было сложно. Думаю, что курс больше подойдет для тех, у кого уже есть небольшой опыт. Понравилось, что выдали сертификат по окончании."
        },
        {
            "author": "Кирилл Соколов",
            "grade": 5,
            "text": "Рад, что выбрал этот курс! Мы писали простое приложение с многопоточностью и SQL, а преподаватель подробно объяснял сложные моменты. Понравился подход с постоянным контролем знаний — это мотивировало заниматься и задавать вопросы."
        },
        {
            "author": "Юлия Павлова",
            "grade": 4,
            "text": "Хороший курс, особенно для новичков. Понравились разделы с базами данных и контроль версий Git. Жаль, что мало времени на Spring и интеграцию с SQL, но в целом довольна. Преподаватель всегда доступен и готов помочь с любыми вопросами."
        }
    ],
    "summarized_reviews": []
}
]