[{
	"name": "Курс 'Cross-platform developer on JavaScript'",
	"start_date": "string",
	"duration": "string",
	"location": "string",
	"description": "string",
	"link": "string",
	"reviews": [
		{
			"author": "Анна Смирнова",
			"grade": 5,
			"text": "Очень довольна курсом! Модули по UX/UI в Figma и основам микрофронтенд-архитектуры действительно расширили мои навыки. Понравилось, что преподаватели используют реальные кейсы для объяснения тем. Особенно порадовал модуль с интеграцией MongoDB и Express — отлично структурировано."
		},
		{
			"author": "Виктор Тихонов",
			"grade": 4,
			"text": "Отличная программа, особенно понравился блок по серверной разработке на Node.js, где мы написали REST API для симуляции библиотеки. Занятия интересные, но иногда хотелось больше времени на вопросы, особенно в темах по тестированию с Jest и CI/CD настройке."
		},
		{
			"author": "Ольга Петрова",
			"grade": 3,
			"text": "Курс неплохой, но материал местами трудноват. Модуль по Redux и управлению состоянием оказался очень сложным. Хотелось бы больше примеров и заданий по этой теме, и немного больше фокусировки на теории перед сложными практиками."
		},
		{
			"author": "Евгений Борисов",
			"grade": 5,
			"text": "Учебный процесс на высоте! Командная работа над разработкой чат-приложения помогла лучше понять процессы работы с WebSocket и сборку релизов для web и mobile. Много ценной информации и обратной связи от преподавателей."
		},
		{
			"author": "Дарья Иванова",
			"grade": 4,
			"text": "Хороший курс, хотя цена могла бы быть чуть ниже. В остальном всё понравилось: глубокое погружение в React, включая hooks и рендеринг компонентов. Задания интересные, особенно понравилась практика с MongoDB для хранения пользовательских данных."
		},
		{
			"author": "Максим Козлов",
			"grade": 2,
			"text": "Ожидал больше от курса. Практика по интеграции сторонних API была короткой и малоинформативной. Хотелось бы глубже изучить работу с авторизацией и защитой данных. Темп быстрый, тяжело усваивать, особенно работу с SSR и Next.js."
		},
		{
			"author": "Александр Семенов",
			"grade": 5,
			"text": "Рекомендую! Изучили TDD и как писать unit-тесты для сложных компонентов, что стало для меня новым уровнем в разработке. Командные проекты также отличная возможность понять, как вести код-ревью и делать pull requests."
		},
		{
			"author": "Марина Павлова",
			"grade": 4,
			"text": "Замечательные преподаватели и команда. Модуль по клиент-серверному взаимодействию оказался полезным — научились настраивать аутентификацию через JWT и работать с middlewares в Express. Иногда было сложно совмещать с работой, но помощь куратора всегда спасала."
		},
		{
			"author": "Николай Жуков",
			"grade": 3,
			"text": "Интересный курс, но ожидал больше практики с реальными проектами. Блок по micro-frontend был интересным, но, как оказалось, недостаточно практическим. Возможно, стоит добавить больше времени для полноценного развертывания микросервисов."
		},
		{
			"author": "Татьяна Крылова",
			"grade": 5,
			"text": "Потрясающая программа! Особенно понравился раздел с проектированием UI в Figma и работа с компонентами в React. Преподаватель помогал разбираться даже в мелочах. Большой плюс — командные проекты с полноценной интеграцией API."
		},
		{
			"author": "Игорь Лебедев",
			"grade": 4,
			"text": "Очень полезный курс для тех, кто уже знаком с основами JavaScript. Темы сложные, но интересные, особенно разработка бэкэнда на Node с использованием Express и Mongo. Хотелось бы побольше времени на разбор тестов с Jest."
		},
		{
			"author": "Светлана Григорьева",
			"grade": 2,
			"text": "Слишком сложно для новичка в JavaScript. Модуль по управлению состоянием оказался сложным, а темы про микросервисы не дали четкого представления. Поняла далеко не всё, возможно, нужна дополнительная подготовка для таких курсов."
		},
		{
			"author": "Дмитрий Кузьмин",
			"grade": 5,
			"text": "Курс действительно помог перейти на новый уровень! Особенно запомнились разделы по TDD и CI/CD. Много узнал о построении full-stack приложений. Финальная аттестация дала уверенность в своих знаниях. Сильный курс, рекомендую!"
		},
		{
			"author": "Алина Васильева",
			"grade": 3,
			"text": "Курс хороший, но сложный для совмещения с работой. Темы по интеграции с внешними сервисами и работе с MongoDB нуждаются в доработке. Хотелось бы больше материалов для самостоятельной подготовки и разбора тем."
		},
		{
			"author": "Роман Зайцев",
			"grade": 4,
			"text": "Очень доволен курсом! Особенно полезными были практики по написанию тестов на Jest и настройке DevOps. Реальный проект по разработке SPA для мобильного приложения дал ценный опыт работы с адаптивными интерфейсами."
		}
	],
	"summarized_reviews": [
		"Высокая оценка за практическое обучение и UX/UI проектирование.",
		"Понравился блок по Node.js, но хочется больше времени для вопросов.",
		"Некоторые студенты испытывали трудности с Redux и управлением состоянием.",
		"Командные проекты с WebSocket и mobile/web сборками получили хорошие отзывы.",
		"Пользователи высоко оценили работу с MongoDB и React, но отметили высокую стоимость.",
		"Некоторым студенам курс показался сложным, с быстрым темпом.",
		"Положительная оценка за интеграцию с JWT и middlewares в Express.",
		"Отзывы показывают заинтересованность в большем количестве практических заданий и реальных проектов."
	]
}]